Docs/Schemas/ProductCompliance/1.0.0/Examples/GetCompliance/RequestStructure.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.promostandards.org/WSDL/ProductComplianceService/1.0.0/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:GetComplianceRequest>
         <ns:wsVersion>?</ns:wsVersion>
         <ns:id>?</ns:id>
         <!--Optional:-->
         <ns:password>?</ns:password>
         <ns:productId>?</ns:productId>
         <!--Optional:-->
         <ns:partId>?</ns:partId>
      </ns:GetComplianceRequest>
   </soapenv:Body>
</soapenv:Envelope>